api/lib/facturacion/wsdl/facturacionDocumentoAjuste.wsdl

<wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="https://siat.impuestos.gob.bo/ServicioFacturacionDocumentoAjuste" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns2="http://schemas.xmlsoap.org/soap/http" xmlns:ns1="https://siat.impuestos.gob.bo/" name="ServicioFacturacion" targetNamespace="https://siat.impuestos.gob.bo/ServicioFacturacionDocumentoAjuste">
<wsdl:import location="https://pilotosiatservicios.impuestos.gob.bo/v2/ServicioFacturacionDocumentoAjuste?wsdl=ServicioFacturacion.wsdl" namespace="https://siat.impuestos.gob.bo/"> </wsdl:import>
<wsdl:binding name="ServicioFacturacionSoapBinding" type="ns1:ServicioFacturacion">
<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
<wsdl:operation name="anulacionDocumentoAjuste">
<soap:operation soapAction="" style="document"/>
<wsdl:input name="anulacionDocumentoAjuste">
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output name="anulacionDocumentoAjusteResponse">
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="reversionAnulacionDocumentoAjuste">
<soap:operation soapAction="" style="document"/>
<wsdl:input name="reversionAnulacionDocumentoAjuste">
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output name="reversionAnulacionDocumentoAjusteResponse">
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="verificarComunicacion">
<soap:operation soapAction="" style="document"/>
<wsdl:input name="verificarComunicacion">
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output name="verificarComunicacionResponse">
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="recepcionDocumentoAjuste">
<soap:operation soapAction="" style="document"/>
<wsdl:input name="recepcionDocumentoAjuste">
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output name="recepcionDocumentoAjusteResponse">
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="verificacionEstadoDocumentoAjuste">
<soap:operation soapAction="" style="document"/>
<wsdl:input name="verificacionEstadoDocumentoAjuste">
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output name="verificacionEstadoDocumentoAjusteResponse">
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
</wsdl:binding>
<wsdl:service name="ServicioFacturacion">
<wsdl:port binding="tns:ServicioFacturacionSoapBinding" name="ServicioFacturacionPort">
<soap:address location="https://pilotosiatservicios.impuestos.gob.bo/v2/ServicioFacturacionDocumentoAjuste"/>
</wsdl:port>
</wsdl:service>
</wsdl:definitions>
